
    [ 
                      {
    "newsimageurl": "https://pcgamesdatabase.de/images/news/epicstore.jpg",
    "newstext": "Epic Games has officially introduced Unified Payments Interface (UPI) support on the Epic Games Store for Indian users. This long-awaited addition allows customers in India to seamlessly make purchases using their UPI IDs—no credit card, debit card, or PayPal required "
   }, 
          {
    "newsimageurl": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/1285190/986a88d1b0e1420b00183def2a7034508353afa3/header.jpg?t=1746221078",
    "newstext": "Borderlands 4 is now available on Steam for wishlist, with a planned release date of September 12, 2025. Developed by Gearbox, the next chapter in the looter-shooter series promises new worlds, wild weapons, and chaotic co-op action. Stay tuned for more reveals and updates!"
   }, 

          {
    "newsimageurl": "https://shared.fastly.steamstatic.com/store_item_assets/steam/spotlights/083c5c7b9b160be5b2f83cc1/spotlight_image_english.jpg?t=1748904649",
    "newstext": "The Borderlands Franchise Sale is now live on Steam, offering substantial discounts on the entire series. As part of this event, you can claim Borderlands 2 for free until June 8, 2025, at 10:00 AM PT. The sale continues until June 18, 2025, at 10:00 AM PT, featuring up to 95% off on titles like Borderlands 3, Tiny Tina's Wonderlands, and New Tales from the Borderlands."
   }, 


             {
    "newsimageurl": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202505/gta-6-030949590-16x9_0.jpg?VersionId=sFS6TbAA4havw2n89YB.2zjhgAT6sUwf&size=690:388",
    "newstext": "Rockstar has released the second trailer for GTA VI, confirming the official release date as May 26, 2026. The trailer offers a deeper look at protagonists Jason and Lucia in a modern-day Vice City. The game is coming to PS5 and Xbox Series X|S."
   }, 
           {
    "newsimageurl": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202505/gta-6-030949590-16x9_0.jpg?VersionId=sFS6TbAA4havw2n89YB.2zjhgAT6sUwf&size=690:388",
    "newstext": "Rockstar Games has confirmed that Grand Theft Auto VI will launch on May 26, 2026. The delay aims to ensure the game meets the high expectations of fans. Rockstar thanked players for their patience and promised more updates soon."
   }, 
        {
    "newsimageurl": "https://techcrunch.com/wp-content/uploads/2021/06/ea-featured-tile-generic-electronic-arts.png.adapt_.crop16x9.1023w.png",
    "newstext": "Electronic Arts (EA) has kicked off its Sale on Steam, offering discounts of up to 95% on select titles. This limited-time sale is a great chance for gamers to grab popular EA games at heavily discounted prices. Don't miss out!"
   },  
     {
    "newsimageurl": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/1907770/17840d8d7b2067e6a9135231d972b0fe26bf2638/header.jpg?t=1745617446",
    "newstext": "The Bridge Constructor Franchise Sale is live on Steam from April 28 to May 12, 2025. Enjoy up to 92% off on popular titles like Bridge Constructor Portal, Medieval, and Stunts. The complete Bridge Constructor Bundle is also 90% off, offering great value for fans of physics-based puzzle games. Don’t miss this limited-time event!"
   },      
    {
    "newsimageurl": "https://shared.fastly.steamstatic.com/store_item_assets/steam/spotlights/4ebb411615009dbc8467e85c/spotlight_image_english.png?t=1745603450",
    "newstext": "​Curve Games is currently hosting a Publisher Sale on Steam, offering discounts of up to 90% on a variety of indie titles. This is an excellent opportunity to explore acclaimed games like Human: Fall Flat, The Ascent, and For The King at significantly reduced prices. The sale is time-limited, so be sure to check it out soon."
   },     
  {
    "newsimageurl": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/3240220/header.jpg?t=1741381848",
    "newstext": "GTA 5 Enhanced Version is now available on Steam, Epic Games Store, and other platforms, featuring improved graphics, faster loading, and enhanced gameplay. Players who own the GTA 5 Legacy Edition will receive the Enhanced Version as a free upgrade. New players can purchase the latest version to experience the ultimate open-world crime saga."
   },  
      {
    "newsimageurl": "https://cdn.dlcompare.com/others_jpg/upload/news/image/en-steam-spring-sale-2025-has-ar-ea14498a-image-ea144972.jpg.webp",
    "newstext": "The Steam Spring Sale has officially begun and runs through March 20th at 10 PM PT! Enjoy massive discounts on thousands of games, including popular AAA titles and indie gems. Don't miss out on this limited-time event!"
   },    
   
  {
    "newsimageurl": "https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/1551360/header.jpg?t=1741106928",
    "newstext": "Forza Horizon 5 is now available for pre-order on the PlayStation Store for $59.99, with a release date of April 29, 2025. Pre-orders include bonuses like 5,000 Forzathon Points, 5 Backstage Passes, and the 2021 Mercedes-AMG One. The game supports cross-play between PlayStation 5, Xbox, and PC."
   }
    ]
